tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/system/faSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default none;
}

gradSchemes
{
    default leastSquares;
}

divSchemes
{
    default Gauss linear;
}

laplacianSchemes
{
    default none;
}

interpolationSchemes
{
    default linear;
}

// ************************************************************************* //
