tutorials/surfaceTracking/interTrackFoam/tangSurfTenTest3D/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          1e-02;
        smoother        DIC;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 150;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

//     "(pFinal|U)"
    "pFinal"
    {
        $p;
        relTol          0;
    }

//     "(c)"
    "(U|c)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors         100;
    nCorrectors              2;
    nNonOrthogonalCorrectors 0;
    pRefPoint                (0 0.002 -1e-6);
    pRefValue                0;

    momentumPredictor yes;
//     momentumPredictor no;

    residualControl
    {
        U
        {
                tolerance  1e-05;
                relTol     0;
        }
        p
        {
                tolerance  1e-05;
                relTol     0;
        }
     }
}

relaxationFactors
{
    U        0.7;
    p        0.3;
    c        1.0;
}

// ************************************************************************* //
